2018/python-collection.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-08-12 周日 11:30 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Python 容器</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css"/>

</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">Python 容器</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org8dae98a">1. 简介</a></li>
<li><a href="#orgfae680a">2. Python2 &amp; Python3</a>
<ul>
<li><a href="#org000c60f">2.1. Counter</a>
<ul>
<li><a href="#org61763b0">2.1.1. 方法</a></li>
</ul>
</li>
<li><a href="#orge7c031e">2.2. deque</a>
<ul>
<li><a href="#orgb5b8b0e">2.2.1. 方法</a></li>
<li><a href="#orgb8ed662">2.2.2. 属性</a></li>
</ul>
</li>
<li><a href="#org59ba65f">2.3. defaultdict</a></li>
<li><a href="#orgaf40875">2.4. namedtuple</a></li>
<li><a href="#orgb5d4f85">2.5. OrderedDict</a>
<ul>
<li><a href="#org4c8f71b">2.5.1. 方法</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orga81a38b">3. Python3</a>
<ul>
<li><a href="#org2c92574">3.1. ChainMap</a>
<ul>
<li><a href="#org6a55513">3.1.1. 方法</a></li>
<li><a href="#orga115c65">3.1.2. 属性</a></li>
</ul>
</li>
<li><a href="#orgf0a9f71">3.2. Other</a></li>
</ul>
</li>
<li><a href="#orge93e60f">4. 相关链接</a></li>
</ul>
</div>
</div>

<div id="outline-container-org8dae98a" class="outline-2">
<h2 id="org8dae98a"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>Python</code> 的内置模块 <code>collections</code> 提供了通用内置容器 <code>dict</code>, <code>list</code>, <code>set</code>, <code>tuple</code> 的替代方案。
</p>

<p>
<code>Python2</code> 和 <code>Python3</code> 在这个模块上具有一些区别， 所以后面的内容分为：
</p>
<ul class="org-ul">
<li><code>Python2</code> 和 <code>Python3</code> 都支持的容器类型</li>
<li><code>Python3</code> 支持的容器类型</li>
</ul>
</div>
</div>

<div id="outline-container-orgfae680a" class="outline-2">
<h2 id="orgfae680a"><span class="section-number-2">2</span> Python2 &amp; Python3</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org000c60f" class="outline-3">
<h3 id="org000c60f"><span class="section-number-3">2.1</span> Counter</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>Counter</code> 提供计数器以支持方便快捷的计数。
</p>

<p>
一个例子：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">lst</span> = [1, 2, 3, 4, 5, 6, 6, 6, 2, 1]
&gt;&gt;&gt; Counter(lst)
Counter({6: 3, 1: 2, 2: 2, 3: 1, 4: 1, 5: 1})
</pre>
</div>

<p>
初始化 <code>Counter</code> 对象：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter()                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#31354;&#30340;&#26032;&#23481;&#22120;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(<span style="font-style: italic;">'abcdefg'</span>)              <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;&#19968;&#20010;&#21487;&#36845;&#20195;&#23545;&#35937;&#21021;&#22987;&#21270;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter({<span style="font-style: italic;">'red'</span>: 4, <span style="font-style: italic;">'blue'</span>: 2})  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;&#19968;&#20010;&#26144;&#23556;&#23545;&#35937;&#21021;&#22987;&#21270;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(boy=30, girl=8)         <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#36890;&#36807;&#20851;&#38190;&#23383;&#21442;&#25968;&#21021;&#22987;&#21270;</span>
</pre>
</div>

<p>
和 <code>dict</code> 的一个不同：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#35775;&#38382;&#19981;&#23384;&#22312;&#30340;&#38190;&#26102;&#65292; &#19981;&#26159;&#24341;&#21457; KeyError, &#32780;&#26159;&#36820;&#22238;&#19968;&#20010; 0 &#35745;&#25968;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter([<span style="font-style: italic;">'girl'</span>, <span style="font-style: italic;">'boy'</span>])
&gt;&gt;&gt; c
Counter({<span style="font-style: italic;">'boy'</span>: 1, <span style="font-style: italic;">'girl'</span>: 1})
&gt;&gt;&gt; c[<span style="font-style: italic;">'nogirl'</span>]
0
</pre>
</div>
</div>

<div id="outline-container-org61763b0" class="outline-4">
<h4 id="org61763b0"><span class="section-number-4">2.1.1</span> 方法</h4>
<div class="outline-text-4" id="text-2-1-1">
<dl class="org-dl">
<dt>elements()</dt><dd><p>
返回计数器中的所有元素的 <b>迭代器</b>, 每个元素的重复次数和其计数相同。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(a=4, b=2, c=0, d=-2)
&gt;&gt;&gt; <span style="font-weight: bold;">list</span>(c.elements())
[<span style="font-style: italic;">'a'</span>, <span style="font-style: italic;">'a'</span>, <span style="font-style: italic;">'a'</span>, <span style="font-style: italic;">'a'</span>, <span style="font-style: italic;">'b'</span>, <span style="font-style: italic;">'b'</span>]
</pre>
</div></dd>

<dt>most_common([n])</dt><dd><p>
列出出现次数最多的 <code>n</code> 个元素及其计数， 如果省略 <code>n</code>, 便返回所有元素。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; Counter(<span style="font-style: italic;">'abracadabra'</span>).most_common(3)
[(<span style="font-style: italic;">'a'</span>, 5), (<span style="font-style: italic;">'r'</span>, 2), (<span style="font-style: italic;">'b'</span>, 2)]
</pre>
</div></dd>

<dt>substract([iterable-or-mapping])</dt><dd><p>
从一个 <b>可迭代</b> 对象或一个 <b>映射</b> 对象中减去元素计数。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(a=4, b=2, c=0, d=-2)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = Counter(a=1, b=2, c=3, d=4)
&gt;&gt;&gt; c.subtract(d)
&gt;&gt;&gt; c
Counter({<span style="font-style: italic;">'a'</span>: 3, <span style="font-style: italic;">'b'</span>: 0, <span style="font-style: italic;">'c'</span>: -3, <span style="font-style: italic;">'d'</span>: -6})
</pre>
</div></dd>

<dt>update([iterable-or-mapping])</dt><dd><p>
从一个 <b>可迭代</b> 对象或一个 <b>映射</b> 对象中加上元素计数。
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(a=4, b=2, c=0, d=-2)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = Counter(a=1, b=2, c=3, d=4)
&gt;&gt;&gt; c.update(d)
&gt;&gt;&gt; c
Counter({<span style="font-style: italic;">'a'</span>: 5, <span style="font-style: italic;">'b'</span>: 4, <span style="font-style: italic;">'c'</span>: 3, <span style="font-style: italic;">'d'</span>: 2})
</pre>
</div></dd>

<dt>数学运算</dt><dd><div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(a=3, b=1)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = Counter(a=1, b=2)
&gt;&gt;&gt; c + d                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">add two counters together:  c[x] + d[x]</span>
Counter({<span style="font-style: italic;">'a'</span>: 4, <span style="font-style: italic;">'b'</span>: 3})
&gt;&gt;&gt; c - d                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">subtract (keeping only positive counts)</span>
Counter({<span style="font-style: italic;">'a'</span>: 2})
&gt;&gt;&gt; c &amp; d                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">intersection:  min(c[x], d[x])</span>
Counter({<span style="font-style: italic;">'a'</span>: 1, <span style="font-style: italic;">'b'</span>: 1})
&gt;&gt;&gt; c | d                       <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">union:  max(c[x], d[x])</span>
Counter({<span style="font-style: italic;">'a'</span>: 3, <span style="font-style: italic;">'b'</span>: 2})

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Python3 &#36824;&#25903;&#25345;</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = Counter(a=2, b=-4)
&gt;&gt;&gt; +c
Counter({<span style="font-style: italic;">'a'</span>: 2})
&gt;&gt;&gt; -c
Counter({<span style="font-style: italic;">'b'</span>: 4})
</pre>
</div></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-orge7c031e" class="outline-3">
<h3 id="orge7c031e"><span class="section-number-3">2.2</span> deque</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>deque</code> 是提供快速追加和两端弹出的类列表容器。
</p>

<p>
初始化 <code>deque</code> 对象：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">deque([iterable[, maxlen]]) --&gt; deque object</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">param: iterable --&gt; &#21487;&#36845;&#20195;&#23545;&#35937;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">param: maxlen --&gt; &#23450;&#20041; deque &#30340;&#26368;&#22823;&#38271;&#24230;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#22914;&#26524; maxlen &#20026; None, deque &#21487;&#22686;&#38271;&#21040;&#20219;&#24847;&#38271;&#24230;</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#22914;&#26524; maxlen &#19981;&#20026; None, &#22312; deque &#36798;&#21040;&#26368;&#22823;&#38271;&#24230;&#26102;&#65292; &#28155;&#21152;&#20803;&#32032;&#30340;&#21516;&#26102;&#20174;&#23545;&#31471;&#21024;&#38500;&#30456;&#21516;&#25968;&#37327;&#30340;&#20803;&#32032;</span>

&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = deque([1,2,3,4,5,6,7,8,9], maxlen=10)
&gt;&gt;&gt; d.append(10)
&gt;&gt;&gt; d
deque([1, 2, 3, 4, 5, 6, 7, 8, 9, 10], maxlen=10)
&gt;&gt;&gt; d.append(11)
&gt;&gt;&gt; d
deque([2, 3, 4, 5, 6, 7, 8, 9, 10, 11], maxlen=10)
</pre>
</div>
</div>
