2018/python-collection.html

<div id="outline-container-orgb5b8b0e" class="outline-4">
<h4 id="orgb5b8b0e"><span class="section-number-4">2.2.1</span> 方法</h4>
<div class="outline-text-4" id="text-2-2-1">
<dl class="org-dl">
<dt>append(x)</dt><dd>添加 <code>x</code> 到右端</dd>

<dt>appendleft(x)</dt><dd>添加 <code>x</code> 到左端</dd>

<dt>clear()</dt><dd>移除所有元素使 <code>deque</code> 的长度为零</dd>

<dt>copy()</dt><dd>创建一个 <code>deque</code> 的浅表副本</dd>

<dt>count(x)</dt><dd>获取等于 <code>x</code> 的元素的个数</dd>

<dt>extend(iterable)</dt><dd>使用可迭代对象的元素扩展 <code>deque</code> 的右端</dd>

<dt>extendleft(iterable)</dt><dd>使用可迭代对象的元素扩展 <code>deque</code> 的左端</dd>

<dt>index(x[, start[, stop]])</dt><dd>(<i>python3</i>) 返回 <code>deque</code> 中的 <code>x</code> 的位置（在索引开始处或索引停止之前）。
如果未找到， 引发 <code>ValueError</code></dd>

<dt>insert(i, x)</dt><dd>(<i>python3</i>) 在 <code>i</code> 处插入 <code>x</code>, 如果 <code>insert</code> 将导致 <code>deque</code> 大长度超出 <code>maxlen</code>, 将会引发 <code>IndexError</code>.</dd>

<dt>pop()</dt><dd>移除右端的一个元素， 如果 <code>deque</code> 为空， 引发 <code>IndexError</code></dd>

<dt>popleft()</dt><dd>移除左端的一个元素， 如果 <code>deque</code> 为空， 引发 <code>IndexError</code></dd>

<dt>remove(value)</dt><dd>移除第一个 <code>value</code>, 如果不存在引发 <code>ValueError</code></dd>

<dt>reversse()</dt><dd>翻转 <code>deque</code> 并返回 <code>None</code></dd>

<dt>ronate(n=1)</dt><dd><p>
根据指定的 <code>step</code> 向右翻转 <code>deque</code>. 如果 <code>n</code> 为负数， 便向左翻转。
</p>

<p>
注： <code>n</code> 不是关键字参数
</p></dd>
</dl>
</div>
</div>

<div id="outline-container-orgb8ed662" class="outline-4">
<h4 id="orgb8ed662"><span class="section-number-4">2.2.2</span> 属性</h4>
<div class="outline-text-4" id="text-2-2-2">
<dl class="org-dl">
<dt>maxlen</dt><dd>只读属性， 返回 <code>maxlen</code> 或 <code>None</code></dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org59ba65f" class="outline-3">
<h3 id="org59ba65f"><span class="section-number-3">2.3</span> defaultdict</h3>
<div class="outline-text-3" id="text-2-3">
<p>
<code>defaultdict</code> 是 <code>dict</code> 的一个子类， 覆盖了一个方法并添加了一个可写实例变量。
</p>

<p>
<code>defaultdict</code> 的第一个参数用来初始化 <code>defaul_factory</code>, 其余参数和 <code>dict</code> 相同。
</p>

<ul class="org-ul">
<li><p>
覆盖的方法： <code>__missing__(key)</code>
</p>

<p>
这个方法受添加的可写实例变量 <code>default_factory</code> 影响。
</p>

<p>
如果 <code>default_factory</code> 为 <code>None</code>, 则这个方法的行为和 <code>dict</code> 中一样， 抛出 <code>KeyError</code>.
</p>

<p>
如果 <code>default_factory</code> 不是 <code>None</code>, 则在访问不存在的键时， 调用这个属性为给定键设置默认值。
</p></li>

<li><p>
新增实例属性： <code>default_factory</code>
</p>

<p>
这个属性通过构造函数的第一个参数初始化， 如果不存在， 便设为 <code>None</code>.
</p></li>

<li><p>
使用例：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">s</span> = <span style="font-style: italic;">'mississippi'</span>
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = defaultdict(<span style="font-weight: bold;">int</span>)
&gt;&gt;&gt; <span style="font-weight: bold;">for</span> k <span style="font-weight: bold;">in</span> s:
...     <span style="font-weight: bold; font-style: italic;">d</span>[k] += 1  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">dict &#20013;&#20250;&#24341;&#21457; KeyError</span>
...
&gt;&gt;&gt; <span style="font-weight: bold;">sorted</span>(d.items())
[(<span style="font-style: italic;">'i'</span>, 4), (<span style="font-style: italic;">'m'</span>, 1), (<span style="font-style: italic;">'p'</span>, 2), (<span style="font-style: italic;">'s'</span>, 4)]
</pre>
</div></li>
</ul>
</div>
</div>

<div id="outline-container-orgaf40875" class="outline-3">
<h3 id="orgaf40875"><span class="section-number-3">2.4</span> namedtuple</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>namedtuple</code> 是用于创建具有命名字段的元组子类的工厂函数。
</p>

<p>
使用这个函数有两个步骤：
</p>
<ol class="org-ol">
<li>调用函数获取元组子类</li>
<li>使用这个元组子类创建具有命名字段的元组</li>
</ol>

<p>
<code>namedtuple</code> 创建的元组子类向后兼容于 <code>tuple</code>.
</p>

<p>
使用这个函数：
</p>
<ul class="org-ul">
<li><b>namedtuple(typename, field_names[, verbose=False][, rename=False])</b>

<ul class="org-ul">
<li><code>typename</code> 定义返回的元组子类的名称</li>

<li><p>
<code>field_names</code> 定义字段名， 是一个序列对象。
</p>

<p>
允许的格式：
</p>
<ol class="org-ol">
<li>类似于 <code>['x', 'y']</code></li>

<li>用空格或逗号分割字符串： 'x y' 或 'x, y'</li>
</ol></li>

<li><p>
<code>rename</code> 如果为 <code>True</code>, <code>field_names</code> 存在非法字段名时， 会自动重命名字段。
</p>

<p>
如： <code>['abc', 'def', 'ghi', 'abc']</code> &#x2013;&gt; <code>['abc', '_1', 'ghi', '_3']</code>
</p>

<p>
其中， <code>abc</code> 为重复的字段名。
</p></li>

<li><code>verbose</code> 如果为 <code>True</code>, 在类的构建之前打印类的定义（感觉没什么用）</li>
</ul></li>
</ul>

<p>
例子：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold;">from</span> collections <span style="font-weight: bold;">import</span> namedtuple
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">human</span> = namedtuple(<span style="font-style: italic;">'human'</span>, <span style="font-style: italic;">'name, age, sex'</span>)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">man</span> = human(name=<span style="font-style: italic;">'***'</span>, age=<span style="font-style: italic;">'**'</span>, sex=<span style="font-style: italic;">'&#9794;'</span>)
&gt;&gt;&gt; man
human(name=<span style="font-style: italic;">'***'</span>, age=<span style="font-style: italic;">'**'</span>, sex=<span style="font-style: italic;">'&#9794;'</span>)
&gt;&gt;&gt; man.sex
<span style="font-style: italic;">'&#9794;'</span>
&gt;&gt;&gt; man[2]
<span style="font-style: italic;">'&#9794;'</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb5d4f85" class="outline-3">
<h3 id="orgb5d4f85"><span class="section-number-3">2.5</span> OrderedDict</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>OrderedDict</code> 和 <code>Dict</code> 不同的是， 它们会记住元素添加的顺序。
</p>

<p>
<code>OrderedDict</code> 的初始化和 <code>Dict</code> 的初始化是相同的， 但是会记住键的首次插入的顺序。
</p>

<p>
如果键的值被修改， 它的顺序不会被改变。
</p>
</div>

<div id="outline-container-org4c8f71b" class="outline-4">
<h4 id="org4c8f71b"><span class="section-number-4">2.5.1</span> 方法</h4>
<div class="outline-text-4" id="text-2-5-1">
<dl class="org-dl">
<dt>popitem(last=True)</dt><dd>如果 <code>last</code> 为 <code>True</code>, 返回最后的键值对。 如果 <code>last</code> 为 <code>False</code>, 返回最前的键值对</dd>

<dt>move_to_end(key, last=True)</dt><dd><p>
(<i>python3</i>) 如果 <code>last</code> 为 <code>True</code>, 将现有键移动到最后。 荣誉感 <code>last</code> 为 <code>False</code>, 将现有键移动到最前。
如果键不存在， 引发 <code>KeyError</code>
</p>

<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = OrderedDict.fromkeys(<span style="font-style: italic;">'abcde'</span>)
&gt;&gt;&gt; d.move_to_end(<span style="font-style: italic;">'b'</span>)
&gt;&gt;&gt; <span style="font-style: italic;">''</span>.join(d.keys())
<span style="font-style: italic;">'acdeb'</span>
&gt;&gt;&gt; d.move_to_end(<span style="font-style: italic;">'b'</span>, last=<span style="font-weight: bold; text-decoration: underline;">False</span>)
&gt;&gt;&gt; <span style="font-style: italic;">''</span>.join(d.keys())
<span style="font-style: italic;">'bacde'</span>
</pre>
</div></dd>
</dl>
</div>
</div>
</div>
</div>

<div id="outline-container-orga81a38b" class="outline-2">
<h2 id="orga81a38b"><span class="section-number-2">3</span> Python3</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org2c92574" class="outline-3">
<h3 id="org2c92574"><span class="section-number-3">3.1</span> ChainMap</h3>
<div class="outline-text-3" id="text-3-1">
<p>
<code>ChainMap</code> 可以将多个 <code>dict</code> 或其他映射组合在一起， 这比使用 <code>update</code> 来的快。
</p>

<p>
<code>ChainMap</code> 初始化：
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">ChainMap(*maps)</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">param: maps &#22810;&#20010;&#26144;&#23556;</span>

&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">m1</span> = <span style="font-weight: bold;">dict</span>(a=1)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">m2</span> = <span style="font-weight: bold;">dict</span>(b=2)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = ChainMap(m1, m2)
&gt;&gt;&gt; c
ChainMap({<span style="font-style: italic;">'a'</span>: 1}, {<span style="font-style: italic;">'b'</span>: 2})
</pre>
</div>

<p>
使用例：
</p>
<div class="org-src-container">
<pre class="src src-python">&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = ChainMap(<span style="font-weight: bold;">dict</span>(m=10))
&gt;&gt;&gt; c
ChainMap({<span style="font-style: italic;">'m'</span>: 10})
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">d</span> = <span style="font-weight: bold;">dict</span>(t=4)
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = c.new_child(d)
&gt;&gt;&gt; c
ChainMap({<span style="font-style: italic;">'t'</span>: 4}, {<span style="font-style: italic;">'m'</span>: 10})
&gt;&gt;&gt; c[<span style="font-style: italic;">'t'</span>]  <span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">&#35775;&#38382;&#20803;&#32032;</span>
4
&gt;&gt;&gt; c.maps
[{<span style="font-style: italic;">'t'</span>: 4}, {<span style="font-style: italic;">'m'</span>: 10}]
&gt;&gt;&gt; c.parents
ChainMap({<span style="font-style: italic;">'m'</span>: 10})
&gt;&gt;&gt; <span style="font-weight: bold; font-style: italic;">c</span> = c.new_child(<span style="font-weight: bold;">dict</span>(m=1))
&gt;&gt;&gt; c
ChainMap({<span style="font-style: italic;">'m'</span>: 1}, {<span style="font-style: italic;">'t'</span>: 4}, {<span style="font-style: italic;">'m'</span>: 10})
&gt;&gt;&gt; c[<span style="font-style: italic;">'m'</span>]
1
</pre>
</div>
</div>
